---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.SpaceSetIterator
source: html/29a76259-67d6-0563-a390-a713633b717f.htm
---
# SpaceSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.